src/InformationRegisters/СтекИзмененийСтатусовСквознойАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтекИзмененийСтатусовСквознойАналитики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСквознойАналитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтекИзмененийСтатусовСквознойАналитики/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура, добавляет запись в регистр сведений;
//
Процедура ДобавитьЗапись(Объект, Статус, ВнешняяСистема) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Объект         = Объект;
	МенеджерЗаписи.ВнешняяСистема = ВнешняяСистема;
	МенеджерЗаписи.Статус         = Статус;
	МенеджерЗаписи.ДатаИзменения  = ТекущаяДатаСеанса();
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Сделки") Тогда
		МенеджерЗаписи.ЭтапСделки     = Объект.ЭтапСделки;
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение		
	КонецПопытки;
	
КонецПроцедуры

// Функция, возвращает список статусов сквозной аналитики.
//
Функция ПолучитьСписокССА(ТипВнешнейСистемы = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтекИзмененийСтатусовСквознойАналитики.Объект КАК Объект,
	|	СтекИзмененийСтатусовСквознойАналитики.ВнешняяСистема КАК ВнешняяСистема,
	|	СтекИзмененийСтатусовСквознойАналитики.Статус КАК Статус,
	|	СтекИзмененийСтатусовСквознойАналитики.ЭтапСделки КАК ЭтапСделки,
	|	СтекИзмененийСтатусовСквознойАналитики.ДатаИзменения КАК ДатаИзменения
	|ИЗ
	|	РегистрСведений.СтекИзмененийСтатусовСквознойАналитики КАК СтекИзмененийСтатусовСквознойАналитики
	|ГДЕ
	|	ИСТИНА
	|	И &УсловиеВнешнейСистемы
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИзменения");
	
	Если ЗначениеЗаполнено(ТипВнешнейСистемы) Тогда 	
		
		УсловиеВнешнейСистемы = "СтекИзмененийСтатусовСквознойАналитики.ВнешняяСистема.ТипВнешнейСистемы = &ТипВнешнейСистемы";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВнешнейСистемы", УсловиеВнешнейСистемы);
		
		Запрос.УстановитьПараметр("ТипВнешнейСистемы", ТипВнешнейСистемы);	
		
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеВнешнейСистемы", "");		
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;
	
КонецФункции

// Процедура, удаляет запись из регистра.
//
Процедура УдалитьЗаписьПоЗаявке(Объект, ВнешняяСистема, Статус = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.ВнешняяСистема = ВнешняяСистема;
	Если Статус <> Неопределено Тогда
		МенеджерЗаписи.Статус = Статус;
	КонецЕсли;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры	

// Функция, возвращает статус объекта по ссылке (заявка или сделка).
//
Функция ВернутьСтатусОбъектаПоСсылке(Ссылка) Экспорт
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СтекИзмененийСтатусовСквознойАналитики.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтекИзмененийСтатусовСквознойАналитики КАК СтекИзмененийСтатусовСквознойАналитики
	|ГДЕ
	|	СтекИзмененийСтатусовСквознойАналитики.Объект = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Статус, Неопределено);
		
КонецФункции

#КонецОбласти
